In [1]:
import numpy as np
import pandas as pd

In [2]:
dict ={"Name":["Ram","Raj","Shyam","Guru"],
      "Marks":[89,69,35,78],
       "City":["Gurgaon","Hyderabad","Bangalore","Pune"]}

In [6]:
df=pd.DataFrame(dict) # making dataframe from dict

In [8]:
print(df)

    Name  Marks       City
0    Ram     89    Gurgaon
1    Raj     69  Hyderabad
2  Shyam     35  Bangalore
3   Guru     78       Pune

In [10]:
df.to_csv("Marks.csv")  # converting dataframe to csv file

In [11]:
df.to_csv("Marks_No_Index.csv",index=False)  # without index

In [12]:
df.head(2) # first 2 rows

  Name  Marks       City
0  Ram     89    Gurgaon
1  Raj     69  Hyderabad

In [13]:
df.tail(2)  # last 2 rows

    Name  Marks       City
2  Shyam     35  Bangalore
3   Guru     78       Pune